## Step 1: Load CSV Data

In [1]:
import pandas as pd

orders = pd.read_csv(r"C:\Users\srira\Downloads\orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

## Step 2: Load JSON Data

In [3]:
import json

with open(r"C:\Users\srira\Downloads\users.json", "r") as f:
    users = pd.DataFrame(json.load(f))

users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

## Step 3: Load SQL Data

In [ ]:
import sqlite3

conn = sqlite3.connect(":memory:")

with open("", "r") as f:
    conn.executescript(f.read())

restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants.head()